{
    "data": [
        {
            "name": "Student",
            "company": "University of Tartu",
            "date": "Aug 2024 - Now",
            "title": "Computer Science student ( 3-year curriculum in 2 years )",
            "description": [
                "I'm studying Computer Science at the University of Tartu, completing a 3-year curriculum in 2 years.",
                "I enjoy experimenting and learning new technologies. For example, I actively participate in competitions and hackathons to challenge myself and to try to be the best."
            ]
        },
        {
            "name": "Freelancer",
            "company": "For Hire",
            "date": "Jun 2024 - Now",
            "title": "Full-stack developer ( Typescript, HTML, CSS, Vue, Wordpress )",
            "description": [
                "After completing mandatory conscript service, I chose to pursue freelance development work to accommodate the flexibility required by my university schedule.",
                "I provide services to small businesses and individuals, including website development, bug fixes, and custom feature implementation."
            ]
        },
        {
            "name": "Engineer + Product Owner",
            "company": "Rent&go",
            "date": "Feb 2021 - Aug 2023",
            "title": "Full-stack Engineer and Product Owner ( Flutter, Dart, Kotlin, Swift, Figma)",
            "description": [
                "I was responsible for designing and building a cross-platform mobile application from the ground up. ",
                "Over a 2-year period, I:",
                "1) Designed the UI/UX in Figma",
                "2) Created and implemented business logic in collaboration with stakeholders", 
                "3) Built and maintained the application using the Flutter framework",
                "4) Tested the application across multiple devices and platforms",
                "5) Published the application on both Android and iOS."
            ]
        },
        {
            "name": "Activity Coordinator",
            "company": "360 KRAADI",
            "date": "Jul 2022 - Jul 2022",
            "title": "Activity Coordinator ( Communication, Teaching, Organising )",
            "description": [
                "Organised outdoor events mostly for corporate groups, where I was responsible for coordinating activities, communicating with clients, and teaching participants how to use the equipment."
            ]
        },
        {
            "name": "Content Producer",
            "company": "CTF Tech",
            "date": "May 2022 - Jun 2022",
            "title": "Cyber Security Content Producer ( Writing, Proofreading, Research, Filming, Editing )",
            "description": [
                "I was responsible for producing educational content for the company's YouTube channel."
            ]
        }
    ]
}